Blockchain.org
#+TITLE: Blockchain
#+OPTIONS: num:t
#+STARTUP: content
#+EXPORT_FILE_NAME: /home/si/Dropbox/LiteraturPrograme/html/Blockchain.html
#+PROPERTY: header-args :eval no-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>


* BTC: decentralized currency
** 密码学原理
*** Crypto-Currency
1. cryptographic hash function: collision resistance
2. hidding:
3. digital commitment : digital equivalent of a sealed envelope
4. puzzle friendly: nonce : H(block header)<= target for all possible
input
5. difficult to solve but easy to proof.
*** SAH256 Secure Hash Algorithm

*** Count
**** public key : 加密

**** private key : 解密 : asymmetric encryption algorithm

*** Merkel Tree
块内的交易以树的形状存放

** 节点
*** 重节点
only block header
**** block header
version
hash of previous block header
merkel root hash
target
nonce

*** 轻节点：Merkel Proof : Merkel Tree
block header 
block body
proof of membership : proof of inclusion
** distributed consensus
*** FLP impossibility result
asynchronous :faulty
*** CAP theorem
consistency : Avaliability : Partition tolerance
** fork
*** state fork
forking attack : 挖矿时同时挖到两个块
deliberate fork  :故意制造的
*** protocd fork
 hard fork : software update : block size limit :


* ETH : decentralized contract
memory hard
mining puzzle
proof of work -> proof of stake
SAIC resistance
smart contract
** Patricia Tree

* python
** part1
#+BEGIN_SRC python
  import hashlib
  import json

  class Block():
      def __init__(self, nonce,tstamp, transcation, prevhash=''):
          self.nonce = nonce
          self.tstamp = tstamp
          self.transcation = transcation
          self.prevhash = prevhash
          self.hash =self.calcHash()
      def __str__(self):
          string = 'nonce:'+str(self.nonce)+'\n'
          string += 'tstamp:'+str(self.tstamp)+'\n'
          string += 'transcation:'+str(self.transcation)+'\n'
          string += 'prevhash:'+str(self.prevhash)+'\n'
          string += 'hash:'+str(self.hash)+'\n'
          return string
      def calcHash(self):
          block_string = json.dumps({'nonce':self.nonce, 'tstamp':self.tstamp, 'transcation':self.transcation, 'prevhash':self.prevhash}, sort_keys=True).encode()
          return hashlib.sha256(block_string).hexdigest()

  class Blockchain():
      def __init__(self):
          self.chain=[self.generateGensisBlock(),]
      def generateGensisBlock(self):
          return Block(0,'Fri Oct 26 21:15:12 2018','Gensis Block')
      def getLastBlock(self):
          return self.chain[-1]
      def addBlock(self,newBlock):
          newBlock.prevhash=self.getLastBlock().hash
          newBlock.hash=newBlock.calcHash()
          self.chain.append(newBlock)
      def isChainValid(self):
          for i in range(1,len(self.chain)):
              prevb = self.chain[i-1]
              currb = self.chain[i]
              if(currb.hash != currb.calcHash()):
                  print('invalid block')
                  return False
              if(currb.prevhash != prevb.hash):
                  print('invalid chain')
                  return False
          return True


  shangCoin = Blockchain()
  shangCoin.addBlock(Block(1,'Fri Oct 26 21:22:51 2018',100))
  shangCoin.addBlock(Block(2,'Fri Oct 26 21:23:28 2018',200))

  shangCoin.chain[1].transcation = 66
  print('only change transcation:'+ '\n'+str(shangCoin.chain[1].calcHash()) +'\n'+ str(shangCoin.chain[1].hash))
  #如果只是改了一个transaction的值，在执行calcHash之后的结果肯定不等于之前存在hash属性里的结果一致，会报错
  shangCoin.chain[1].hash =shangCoin.chain[1].calcHash()
  print('after change transcation, and hash all again:'+'\n'+str(shangCoin.chain[2].prevhash)+'\n'+str(shangCoin.chain[1].hash))
  #如果在改变transaction后，再hash整个块，则存在下一个块内的prevhash将不会等于这个块内hash变化后的值

  for b in shangCoin.chain:
      print(b)
      print(shangCoin.isChainValid())


#+END_SRC
