blockchain.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-23 Sun 14:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blockchain</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Blockchain</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5c5f55c">BTC: decentralized currency</a>
<ul>
<li><a href="#org824e9d0">密码学原理</a>
<ul>
<li><a href="#orge23d4f7">Crypto-Currency</a></li>
<li><a href="#org1383f7c">SAH256 Secure Hash Algorithm</a></li>
<li><a href="#orga38b22f">Count</a></li>
<li><a href="#org2e91b11">Merkel Tree</a></li>
</ul>
</li>
<li><a href="#orgba5fe7e">节点</a>
<ul>
<li><a href="#org534d164">重节点</a></li>
<li><a href="#org0d9402e">轻节点：Merkel Proof : Merkel Tree</a></li>
</ul>
</li>
<li><a href="#orgad2a548">distributed consensus</a>
<ul>
<li><a href="#org6365278">FLP impossibility result</a></li>
<li><a href="#org74dbebd">CAP theorem</a></li>
</ul>
</li>
<li><a href="#org42b94ab">fork</a>
<ul>
<li><a href="#org6b3df12">state fork</a></li>
<li><a href="#org50950e9">protocd fork</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge4f264d">ETH : decentralized contract</a>
<ul>
<li><a href="#orge487b57">Patricia Tree</a></li>
</ul>
</li>
<li><a href="#org73148cb">python</a>
<ul>
<li><a href="#orgbe2e452">part1</a></li>
<li><a href="#org56fe04e">part2</a></li>
<li><a href="#orga5bff9f">part3</a></li>
<li><a href="#org546606b">part4 (has error)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5c5f55c" class="outline-2">
<h2 id="org5c5f55c">BTC: decentralized currency</h2>
<div class="outline-text-2" id="text-org5c5f55c">
</div>
<div id="outline-container-org824e9d0" class="outline-3">
<h3 id="org824e9d0">密码学原理</h3>
<div class="outline-text-3" id="text-org824e9d0">
</div>
<div id="outline-container-orge23d4f7" class="outline-4">
<h4 id="orge23d4f7">Crypto-Currency</h4>
<div class="outline-text-4" id="text-orge23d4f7">
<ol class="org-ol">
<li>cryptographic hash function: collision resistance</li>
<li>hidding:</li>
<li>digital commitment : digital equivalent of a sealed envelope</li>
<li>puzzle friendly: nonce : H(block header)&lt;= target for all possible</li>
</ol>
<p>
input
</p>
<ol class="org-ol">
<li>difficult to solve but easy to proof.</li>
</ol>
</div>
</div>
<div id="outline-container-org1383f7c" class="outline-4">
<h4 id="org1383f7c">SAH256 Secure Hash Algorithm</h4>
</div>

<div id="outline-container-orga38b22f" class="outline-4">
<h4 id="orga38b22f">Count</h4>
<div class="outline-text-4" id="text-orga38b22f">
</div>
<ul class="org-ul">
<li><a id="orga97f6e6"></a>public key : 加密<br /></li>

<li><a id="org747bfbe"></a>private key : 解密 : asymmetric encryption algorithm<br /></li>
</ul>
</div>

<div id="outline-container-org2e91b11" class="outline-4">
<h4 id="org2e91b11">Merkel Tree</h4>
<div class="outline-text-4" id="text-org2e91b11">
<p>
块内的交易以树的形状存放
</p>
</div>
</div>
</div>

<div id="outline-container-orgba5fe7e" class="outline-3">
<h3 id="orgba5fe7e">节点</h3>
<div class="outline-text-3" id="text-orgba5fe7e">
</div>
<div id="outline-container-org534d164" class="outline-4">
<h4 id="org534d164">重节点</h4>
<div class="outline-text-4" id="text-org534d164">
<p>
only block header
</p>
</div>
<ul class="org-ul">
<li><a id="orgeced39b"></a>block header<br />
<div class="outline-text-5" id="text-orgeced39b">
<p>
version
hash of previous block header
merkel root hash
target
nonce
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org0d9402e" class="outline-4">
<h4 id="org0d9402e">轻节点：Merkel Proof : Merkel Tree</h4>
<div class="outline-text-4" id="text-org0d9402e">
<p>
block header 
block body
proof of membership : proof of inclusion
</p>
</div>
</div>
</div>
<div id="outline-container-orgad2a548" class="outline-3">
<h3 id="orgad2a548">distributed consensus</h3>
<div class="outline-text-3" id="text-orgad2a548">
</div>
<div id="outline-container-org6365278" class="outline-4">
<h4 id="org6365278">FLP impossibility result</h4>
<div class="outline-text-4" id="text-org6365278">
<p>
asynchronous :faulty
</p>
</div>
</div>
<div id="outline-container-org74dbebd" class="outline-4">
<h4 id="org74dbebd">CAP theorem</h4>
<div class="outline-text-4" id="text-org74dbebd">
<p>
consistency : Avaliability : Partition tolerance
</p>
</div>
</div>
</div>
<div id="outline-container-org42b94ab" class="outline-3">
<h3 id="org42b94ab">fork</h3>
<div class="outline-text-3" id="text-org42b94ab">
</div>
<div id="outline-container-org6b3df12" class="outline-4">
<h4 id="org6b3df12">state fork</h4>
<div class="outline-text-4" id="text-org6b3df12">
<p>
forking attack : 挖矿时同时挖到两个块
deliberate fork  :故意制造的
</p>
</div>
</div>
<div id="outline-container-org50950e9" class="outline-4">
<h4 id="org50950e9">protocd fork</h4>
<div class="outline-text-4" id="text-org50950e9">
<p>
hard fork : software update : block size limit :
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orge4f264d" class="outline-2">
<h2 id="orge4f264d">ETH : decentralized contract</h2>
<div class="outline-text-2" id="text-orge4f264d">
<p>
memory hard
mining puzzle
proof of work -&gt; proof of stake
SAIC resistance
smart contract
</p>
</div>
