Blockchain.org
** part2
#+BEGIN_SRC python
  import hashlib
  import json

  class Block():
      def __init__(self, nonce,tstamp, transcation, prevhash=''):
          self.nonce = nonce
          self.tstamp = tstamp
          self.transcation = transcation
          self.prevhash = prevhash
          self.hash =self.calcHash()
      def __str__(self):
          string = 'nonce:'+str(self.nonce)+'\n'
          string += 'tstamp:'+str(self.tstamp)+'\n'
          string += 'transcation:'+str(self.transcation)+'\n'
          string += 'prevhash:'+str(self.prevhash)+'\n'
          string += 'hash:'+str(self.hash)+'\n'
          return string
      def calcHash(self):
          block_string = json.dumps({'nonce':self.nonce, 'tstamp':self.tstamp, 'transcation':self.transcation, 'prevhash':self.prevhash}, sort_keys=True).encode()
          return hashlib.sha256(block_string).hexdigest()
      def mineBlock(self,difficult):
          while(self.hash[:difficult] != str('').zfill(difficult)):
              self.nonce += 1
              self.hash = self.calcHash()
              print('the mineBlock is:',self.hash)

  class Blockchain():
      def __init__(self):
          self.chain=[self.generateGensisBlock(),]
          self.difficult = 3
      def generateGensisBlock(self):
          return Block(0,'Fri Oct 26 21:15:12 2018','Gensis Block')
      def getLastBlock(self):
          return self.chain[-1]
      def addBlock(self,newBlock):
          newBlock.prevhash=self.getLastBlock().hash
          newBlock.hash=newBlock.calcHash()
          newBlock.mineBlock(self.difficult)
          self.chain.append(newBlock)
      def isChainValid(self):
          for i in range(1,len(self.chain)):
              prevb = self.chain[i-1]
              currb = self.chain[i]
              if(currb.hash != currb.calcHash()):
                  print('invalid block')
                  return False
              if(currb.prevhash != prevb.hash):
                  print('invalid chain')
                  return False
          return True


  shangCoin = Blockchain()
  print('Adding the first block')
  shangCoin.addBlock(Block(1,'Fri Oct 26 21:22:51 2018',100))
  print('Adding the second block')
  shangCoin.addBlock(Block(2,'Fri Oct 26 21:23:28 2018',200))

  # shangCoin.chain[1].transcation = 66
  # print('only change transcation:'+ '\n'+str(shangCoin.chain[1].calcHash()) +'\n'+ str(shangCoin.chain[1].hash))
  # #如果只是改了一个transaction的值，在执行calcHash之后的结果肯定不等于之前存在hash属性里的结果一致，会报错
  # shangCoin.chain[1].hash =shangCoin.chain[1].calcHash()
  # print('after change transcation, and hash all again:'+'\n'+str(shangCoin.chain[2].prevhash)+'\n'+str(shangCoin.chain[1].hash))
  # #如果在改变transaction后，再hash整个块，则存在下一个块内的prevhash将不会等于这个块内hash变化后的值

  for b in shangCoin.chain:
      print(b)

  if(shangCoin.isChainValid()):

      print('valid blockchain')
  else:
      print('hacked blockchain')



#+END_SRC
