blockchain.html
<div id="outline-container-orge487b57" class="outline-3">
<h3 id="orge487b57">Patricia Tree</h3>
</div>
</div>

<div id="outline-container-org73148cb" class="outline-2">
<h2 id="org73148cb">python</h2>
<div class="outline-text-2" id="text-org73148cb">
</div>
<div id="outline-container-orgbe2e452" class="outline-3">
<h3 id="orgbe2e452">part1</h3>
<div class="outline-text-3" id="text-orgbe2e452">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> hashlib
<span style="font-weight: bold;">import</span> json

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Block</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, nonce,tstamp, transcation, prevhash=<span style="font-style: italic;">''</span>):
        <span style="font-weight: bold;">self</span>.nonce = nonce
        <span style="font-weight: bold;">self</span>.tstamp = tstamp
        <span style="font-weight: bold;">self</span>.transcation = transcation
        <span style="font-weight: bold;">self</span>.prevhash = prevhash
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> =<span style="font-weight: bold;">self</span>.calcHash()
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">'nonce:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.nonce)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'tstamp:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.tstamp)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'transcation:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.transcation)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'prevhash:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.prevhash)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'hash:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold;">return</span> string
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">calcHash</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">block_string</span> = json.dumps({<span style="font-style: italic;">'nonce'</span>:<span style="font-weight: bold;">self</span>.nonce, <span style="font-style: italic;">'tstamp'</span>:<span style="font-weight: bold;">self</span>.tstamp, <span style="font-style: italic;">'transcation'</span>:<span style="font-weight: bold;">self</span>.transcation, <span style="font-style: italic;">'prevhash'</span>:<span style="font-weight: bold;">self</span>.prevhash}, sort_keys=<span style="font-weight: bold; text-decoration: underline;">True</span>).encode()
        <span style="font-weight: bold;">return</span> hashlib.sha256(block_string).hexdigest()

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Blockchain</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.chain=[<span style="font-weight: bold;">self</span>.generateGensisBlock(),]
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">generateGensisBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> Block(0,<span style="font-style: italic;">'Fri Oct 26 21:15:12 2018'</span>,<span style="font-style: italic;">'Gensis Block'</span>)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getLastBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.chain[-1]
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">addBlock</span>(<span style="font-weight: bold;">self</span>,newBlock):
        <span style="font-weight: bold; font-style: italic;">newBlock.prevhash</span>=<span style="font-weight: bold;">self</span>.getLastBlock().<span style="font-weight: bold;">hash</span>
        newBlock.<span style="font-weight: bold;">hash</span>=newBlock.calcHash()
        <span style="font-weight: bold;">self</span>.chain.append(newBlock)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">isChainValid</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1,<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.chain)):
            <span style="font-weight: bold; font-style: italic;">prevb</span> = <span style="font-weight: bold;">self</span>.chain[i-1]
            <span style="font-weight: bold; font-style: italic;">currb</span> = <span style="font-weight: bold;">self</span>.chain[i]
            <span style="font-weight: bold;">if</span>(currb.<span style="font-weight: bold;">hash</span> != currb.calcHash()):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid block'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
            <span style="font-weight: bold;">if</span>(currb.prevhash != prevb.<span style="font-weight: bold;">hash</span>):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid chain'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>


<span style="font-weight: bold; font-style: italic;">shangCoin</span> = Blockchain()
shangCoin.addBlock(Block(1,<span style="font-style: italic;">'Fri Oct 26 21:22:51 2018'</span>,100))
shangCoin.addBlock(Block(2,<span style="font-style: italic;">'Fri Oct 26 21:23:28 2018'</span>,200))

shangCoin.chain[1]<span style="font-weight: bold; font-style: italic;">.transcation</span> = 66
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'only change transcation:'</span>+ <span style="font-style: italic;">'\n'</span>+<span style="font-weight: bold;">str</span>(shangCoin.chain[1].calcHash()) +<span style="font-style: italic;">'\n'</span>+ <span style="font-weight: bold;">str</span>(shangCoin.chain[1].<span style="font-weight: bold;">hash</span>))
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#22914;&#26524;&#21482;&#26159;&#25913;&#20102;&#19968;&#20010;transaction&#30340;&#20540;&#65292;&#22312;&#25191;&#34892;calcHash&#20043;&#21518;&#30340;&#32467;&#26524;&#32943;&#23450;&#19981;&#31561;&#20110;&#20043;&#21069;&#23384;&#22312;hash&#23646;&#24615;&#37324;&#30340;&#32467;&#26524;&#19968;&#33268;&#65292;&#20250;&#25253;&#38169;</span>
shangCoin.chain[1].<span style="font-weight: bold;">hash</span> =shangCoin.chain[1].calcHash()
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'after change transcation, and hash all again:'</span>+<span style="font-style: italic;">'\n'</span>+<span style="font-weight: bold;">str</span>(shangCoin.chain[2].prevhash)+<span style="font-style: italic;">'\n'</span>+<span style="font-weight: bold;">str</span>(shangCoin.chain[1].<span style="font-weight: bold;">hash</span>))
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#22914;&#26524;&#22312;&#25913;&#21464;transaction&#21518;&#65292;&#20877;hash&#25972;&#20010;&#22359;&#65292;&#21017;&#23384;&#22312;&#19979;&#19968;&#20010;&#22359;&#20869;&#30340;prevhash&#23558;&#19981;&#20250;&#31561;&#20110;&#36825;&#20010;&#22359;&#20869;hash&#21464;&#21270;&#21518;&#30340;&#20540;</span>

<span style="font-weight: bold;">for</span> b <span style="font-weight: bold;">in</span> shangCoin.chain:
    <span style="font-weight: bold;">print</span>(b)
    <span style="font-weight: bold;">print</span>(shangCoin.isChainValid())


</pre>
</div>
</div>
</div>
<div id="outline-container-org56fe04e" class="outline-3">
<h3 id="org56fe04e">part2</h3>
<div class="outline-text-3" id="text-org56fe04e">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> hashlib
<span style="font-weight: bold;">import</span> json

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Block</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, nonce,tstamp, transcation, prevhash=<span style="font-style: italic;">''</span>):
        <span style="font-weight: bold;">self</span>.nonce = nonce
        <span style="font-weight: bold;">self</span>.tstamp = tstamp
        <span style="font-weight: bold;">self</span>.transcation = transcation
        <span style="font-weight: bold;">self</span>.prevhash = prevhash
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> =<span style="font-weight: bold;">self</span>.calcHash()
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">'nonce:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.nonce)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'tstamp:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.tstamp)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'transcation:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.transcation)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'prevhash:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.prevhash)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'hash:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold;">return</span> string
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">calcHash</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">block_string</span> = json.dumps({<span style="font-style: italic;">'nonce'</span>:<span style="font-weight: bold;">self</span>.nonce, <span style="font-style: italic;">'tstamp'</span>:<span style="font-weight: bold;">self</span>.tstamp, <span style="font-style: italic;">'transcation'</span>:<span style="font-weight: bold;">self</span>.transcation, <span style="font-style: italic;">'prevhash'</span>:<span style="font-weight: bold;">self</span>.prevhash}, sort_keys=<span style="font-weight: bold; text-decoration: underline;">True</span>).encode()
        <span style="font-weight: bold;">return</span> hashlib.sha256(block_string).hexdigest()
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">mineBlock</span>(<span style="font-weight: bold;">self</span>,difficult):
        <span style="font-weight: bold;">while</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>[:difficult] != <span style="font-weight: bold;">str</span>(<span style="font-style: italic;">''</span>).zfill(difficult)):
            <span style="font-weight: bold;">self</span>.nonce += 1
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> = <span style="font-weight: bold;">self</span>.calcHash()
            <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'the mineBlock is:'</span>,<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>)

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Blockchain</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.chain=[<span style="font-weight: bold;">self</span>.generateGensisBlock(),]
        <span style="font-weight: bold;">self</span>.difficult = 3
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">generateGensisBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> Block(0,<span style="font-style: italic;">'Fri Oct 26 21:15:12 2018'</span>,<span style="font-style: italic;">'Gensis Block'</span>)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getLastBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.chain[-1]
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">addBlock</span>(<span style="font-weight: bold;">self</span>,newBlock):
        <span style="font-weight: bold; font-style: italic;">newBlock.prevhash</span>=<span style="font-weight: bold;">self</span>.getLastBlock().<span style="font-weight: bold;">hash</span>
        newBlock.<span style="font-weight: bold;">hash</span>=newBlock.calcHash()
        newBlock.mineBlock(<span style="font-weight: bold;">self</span>.difficult)
        <span style="font-weight: bold;">self</span>.chain.append(newBlock)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">isChainValid</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1,<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.chain)):
            <span style="font-weight: bold; font-style: italic;">prevb</span> = <span style="font-weight: bold;">self</span>.chain[i-1]
            <span style="font-weight: bold; font-style: italic;">currb</span> = <span style="font-weight: bold;">self</span>.chain[i]
            <span style="font-weight: bold;">if</span>(currb.<span style="font-weight: bold;">hash</span> != currb.calcHash()):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid block'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
            <span style="font-weight: bold;">if</span>(currb.prevhash != prevb.<span style="font-weight: bold;">hash</span>):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid chain'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>


<span style="font-weight: bold; font-style: italic;">shangCoin</span> = Blockchain()
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'Adding the first block'</span>)
shangCoin.addBlock(Block(1,<span style="font-style: italic;">'Fri Oct 26 21:22:51 2018'</span>,100))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'Adding the second block'</span>)
shangCoin.addBlock(Block(2,<span style="font-style: italic;">'Fri Oct 26 21:23:28 2018'</span>,200))

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">shangCoin.chain[1].transcation = 66</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">print('only change transcation:'+ '\n'+str(shangCoin.chain[1].calcHash()) +'\n'+ str(shangCoin.chain[1].hash))</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">#&#22914;&#26524;&#21482;&#26159;&#25913;&#20102;&#19968;&#20010;transaction&#30340;&#20540;&#65292;&#22312;&#25191;&#34892;calcHash&#20043;&#21518;&#30340;&#32467;&#26524;&#32943;&#23450;&#19981;&#31561;&#20110;&#20043;&#21069;&#23384;&#22312;hash&#23646;&#24615;&#37324;&#30340;&#32467;&#26524;&#19968;&#33268;&#65292;&#20250;&#25253;&#38169;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">shangCoin.chain[1].hash =shangCoin.chain[1].calcHash()</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">print('after change transcation, and hash all again:'+'\n'+str(shangCoin.chain[2].prevhash)+'\n'+str(shangCoin.chain[1].hash))</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">#&#22914;&#26524;&#22312;&#25913;&#21464;transaction&#21518;&#65292;&#20877;hash&#25972;&#20010;&#22359;&#65292;&#21017;&#23384;&#22312;&#19979;&#19968;&#20010;&#22359;&#20869;&#30340;prevhash&#23558;&#19981;&#20250;&#31561;&#20110;&#36825;&#20010;&#22359;&#20869;hash&#21464;&#21270;&#21518;&#30340;&#20540;</span>

<span style="font-weight: bold;">for</span> b <span style="font-weight: bold;">in</span> shangCoin.chain:
    <span style="font-weight: bold;">print</span>(b)

<span style="font-weight: bold;">if</span>(shangCoin.isChainValid()):

    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'valid blockchain'</span>)
<span style="font-weight: bold;">else</span>:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'hacked blockchain'</span>)



</pre>
</div>
</div>
</div>
