Blockchain.org
** part3
#+BEGIN_SRC python
  import hashlib
  import json
  from datetime import datetime 
  class Transaction():
      def __init__(self, from_address,to_address, amount):
          self.from_address = from_address
          self.to_address = to_address
          self.amount = amount

  class Block():
      def __init__(self,tstamp, transcationList, prevhash=''):
          self.nonce = 0
          self.tstamp = tstamp
          self.transcationList = transcationList
          self.prevhash = prevhash
          self.hash =self.calcHash()
      def __str__(self):
          string = 'nonce:'+str(self.nonce)+'\n'
          string += 'tstamp:'+str(self.tstamp)+'\n'
          string += 'transcation:'+str(self.transcation)+'\n'
          string += 'prevhash:'+str(self.prevhash)+'\n'
          string += 'hash:'+str(self.hash)+'\n'
          return string
      def calcHash(self):
          block_string = json.dumps({'nonce':self.nonce, 'tstamp':str(self.tstamp), 'transcation':self.transcationList[0].amount, 'prevhash':self.prevhash}, sort_keys=True).encode()
          return hashlib.sha256(block_string).hexdigest()
      def mineBlock(self,difficult):
          while(self.hash[:difficult] != str('').zfill(difficult)):
              self.nonce += 1
              self.hash = self.calcHash()
              print('the mineBlock is:',self.hash)

  class Blockchain():
      def __init__(self):
          self.chain=[self.generateGensisBlock(),]
          self.difficult = 3
          self.pendingTransactions = []
          self.mining_reward = 100

      def generateGensisBlock(self):
          return Block('Fri Oct 26 21:15:12 2018', [Transaction(None,None,0),])

      def getLastBlock(self):
          return self.chain[-1]

      # def addBlock(self,newBlock):
      #     newBlock.prevhash=self.getLastBlock().hash
      #     newBlock.hash=newBlock.calcHash()
      #     newBlock.mineBlock(self.difficult)
      #     self.chain.append(newBlock)
      def minePendingTranaction(self,mining_reward_address):
          block = Block(datetime.now(), self.pendingTransactions)
          block.mineBlock(self.difficult)
          print('Block is mined to get reward:',self.mining_reward)
          self.chain.append(block)
          self.pendingTransactions = [Transaction(None,mining_reward_address, self.mining_reward)]

      def createTransaction(self,T):
          self.pendingTransactions.append(T)

      def getBalence(self,address):
          balance = 0
          for b in self.chain:
              for t in b.transcationList:
                  if t.to_address==address:
                      balance += t.amount
                  if t.from_address==address:
                      balance -= t.amount
          return balance

      def isChainValid(self):
          for i in range(1,len(self.chain)):
              prevb = self.chain[i-1]
              currb = self.chain[i]
              if(currb.hash != currb.calcHash()):
                  print('invalid block')
                  return False
              if(currb.prevhash != prevb.hash):
                  print('invalid chain')
                  return False
          return True


  shangCoin = Blockchain()
  shangCoin.createTransaction(Transaction('address1', 'address2',100))
  shangCoin.createTransaction(Transaction('address2', 'address1',50))
  print('starting mining:')
  shangCoin.minePendingTranaction('shangaddress')
  print('shangCoin miner balance is:', shangCoin.getBalence('shangaddress'))

  shangCoin.createTransaction(Transaction('address1', 'address2',200))
  shangCoin.createTransaction(Transaction('address2', 'address1',150))
  print('starting mining again:')
  shangCoin.minePendingTranaction('shangaddress')
  print('shangCoin miner balance is:', shangCoin.getBalence('shangaddress'))


#+END_SRC
