blockchain.html
<div id="outline-container-orga5bff9f" class="outline-3">
<h3 id="orga5bff9f">part3</h3>
<div class="outline-text-3" id="text-orga5bff9f">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> hashlib
<span style="font-weight: bold;">import</span> json
<span style="font-weight: bold;">from</span> datetime <span style="font-weight: bold;">import</span> datetime 
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Transaction</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, from_address,to_address, amount):
        <span style="font-weight: bold;">self</span>.from_address = from_address
        <span style="font-weight: bold;">self</span>.to_address = to_address
        <span style="font-weight: bold;">self</span>.amount = amount

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Block</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>,tstamp, transcationList, prevhash=<span style="font-style: italic;">''</span>):
        <span style="font-weight: bold;">self</span>.nonce = 0
        <span style="font-weight: bold;">self</span>.tstamp = tstamp
        <span style="font-weight: bold;">self</span>.transcationList = transcationList
        <span style="font-weight: bold;">self</span>.prevhash = prevhash
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> =<span style="font-weight: bold;">self</span>.calcHash()
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">'nonce:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.nonce)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'tstamp:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.tstamp)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'transcation:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.transcation)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'prevhash:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.prevhash)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold; font-style: italic;">string</span> += <span style="font-style: italic;">'hash:'</span>+<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>)+<span style="font-style: italic;">'\n'</span>
        <span style="font-weight: bold;">return</span> string
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">calcHash</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">block_string</span> = json.dumps({<span style="font-style: italic;">'nonce'</span>:<span style="font-weight: bold;">self</span>.nonce, <span style="font-style: italic;">'tstamp'</span>:<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.tstamp), <span style="font-style: italic;">'transcation'</span>:<span style="font-weight: bold;">self</span>.transcationList[0].amount, <span style="font-style: italic;">'prevhash'</span>:<span style="font-weight: bold;">self</span>.prevhash}, sort_keys=<span style="font-weight: bold; text-decoration: underline;">True</span>).encode()
        <span style="font-weight: bold;">return</span> hashlib.sha256(block_string).hexdigest()
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">mineBlock</span>(<span style="font-weight: bold;">self</span>,difficult):
        <span style="font-weight: bold;">while</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>[:difficult] != <span style="font-weight: bold;">str</span>(<span style="font-style: italic;">''</span>).zfill(difficult)):
            <span style="font-weight: bold;">self</span>.nonce += 1
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> = <span style="font-weight: bold;">self</span>.calcHash()
            <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'the mineBlock is:'</span>,<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>)

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Blockchain</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.chain=[<span style="font-weight: bold;">self</span>.generateGensisBlock(),]
        <span style="font-weight: bold;">self</span>.difficult = 3
        <span style="font-weight: bold;">self</span>.pendingTransactions = []
        <span style="font-weight: bold;">self</span>.mining_reward = 100

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">generateGensisBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> Block(<span style="font-style: italic;">'Fri Oct 26 21:15:12 2018'</span>, [Transaction(<span style="font-weight: bold; text-decoration: underline;">None</span>,<span style="font-weight: bold; text-decoration: underline;">None</span>,0),])

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getLastBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.chain[-1]

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">def addBlock(self,newBlock):</span>
    <span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">newBlock.prevhash=self.getLastBlock().hash</span>
    <span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">newBlock.hash=newBlock.calcHash()</span>
    <span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">newBlock.mineBlock(self.difficult)</span>
    <span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">self.chain.append(newBlock)</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minePendingTranaction</span>(<span style="font-weight: bold;">self</span>,mining_reward_address):
        <span style="font-weight: bold; font-style: italic;">block</span> = Block(datetime.now(), <span style="font-weight: bold;">self</span>.pendingTransactions)
        block.mineBlock(<span style="font-weight: bold;">self</span>.difficult)
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'Block is mined to get reward:'</span>,<span style="font-weight: bold;">self</span>.mining_reward)
        <span style="font-weight: bold;">self</span>.chain.append(block)
        <span style="font-weight: bold;">self</span>.pendingTransactions = [Transaction(<span style="font-weight: bold; text-decoration: underline;">None</span>,mining_reward_address, <span style="font-weight: bold;">self</span>.mining_reward)]

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">createTransaction</span>(<span style="font-weight: bold;">self</span>,T):
        <span style="font-weight: bold;">self</span>.pendingTransactions.append(T)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getBalence</span>(<span style="font-weight: bold;">self</span>,address):
        <span style="font-weight: bold; font-style: italic;">balance</span> = 0
        <span style="font-weight: bold;">for</span> b <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.chain:
            <span style="font-weight: bold;">for</span> t <span style="font-weight: bold;">in</span> b.transcationList:
                <span style="font-weight: bold;">if</span> t.to_address==address:
                    <span style="font-weight: bold; font-style: italic;">balance</span> += t.amount
                <span style="font-weight: bold;">if</span> t.from_address==address:
                    <span style="font-weight: bold; font-style: italic;">balance</span> -= t.amount
        <span style="font-weight: bold;">return</span> balance

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">isChainValid</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1,<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.chain)):
            <span style="font-weight: bold; font-style: italic;">prevb</span> = <span style="font-weight: bold;">self</span>.chain[i-1]
            <span style="font-weight: bold; font-style: italic;">currb</span> = <span style="font-weight: bold;">self</span>.chain[i]
            <span style="font-weight: bold;">if</span>(currb.<span style="font-weight: bold;">hash</span> != currb.calcHash()):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid block'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
            <span style="font-weight: bold;">if</span>(currb.prevhash != prevb.<span style="font-weight: bold;">hash</span>):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid chain'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>


<span style="font-weight: bold; font-style: italic;">shangCoin</span> = Blockchain()
shangCoin.createTransaction(Transaction(<span style="font-style: italic;">'address1'</span>, <span style="font-style: italic;">'address2'</span>,100))
shangCoin.createTransaction(Transaction(<span style="font-style: italic;">'address2'</span>, <span style="font-style: italic;">'address1'</span>,50))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'starting mining:'</span>)
shangCoin.minePendingTranaction(<span style="font-style: italic;">'shangaddress'</span>)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'shangCoin miner balance is:'</span>, shangCoin.getBalence(<span style="font-style: italic;">'shangaddress'</span>))

shangCoin.createTransaction(Transaction(<span style="font-style: italic;">'address1'</span>, <span style="font-style: italic;">'address2'</span>,200))
shangCoin.createTransaction(Transaction(<span style="font-style: italic;">'address2'</span>, <span style="font-style: italic;">'address1'</span>,150))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'starting mining again:'</span>)
shangCoin.minePendingTranaction(<span style="font-style: italic;">'shangaddress'</span>)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'shangCoin miner balance is:'</span>, shangCoin.getBalence(<span style="font-style: italic;">'shangaddress'</span>))


</pre>
</div>
</div>
</div>
