Blockchain.org
** part4 (has error)
#+BEGIN_SRC python
  import hashlib
  import json
  from datetime import datetime 
  from flask import Flask
  from flask import jsonify
  from time import time

  class Block():
      def __init__(self, nonce, tstamp, transationList, prevhash='', hash =''):
          self.nonce = nonce
          self.tstamp = tstamp
          self.transationList = transationList
          self.prevhash = prevhash
          if hash == '':
              self.hash = self.calcHash
          else:
              self.hash =hash

      def toDict(self):
          return {'nonce':self.nonce, 'tstamp':str(self.tstamp), 'transation':self.transationList, 'prevhash':self.prevhash, 'hash':self.hash}

      def calcHash(self):
          block_string = json.dumps({'nonce':self.nonce, 'tstamp':str(self.tstamp), 'transation':self.transationList, 'prevhash':self.prevhash}, sort_keys=True).encode()
          return hashlib.sha256(block_string).hexdigest()
      def mineBlock(self, difficult):
          while(self.hash[:difficult] != str('').zfill(difficult)):
              self.nonce += 1
              self.hash = self.calcHash()
              print('the mineBlock is:',self.hash)

  class Blockchain():
      def __init__(self):
          self.chain=[]
          self.difficult=3
          self.pendingTransations = []
          self.mining_reward = 100
          self.generateGensisBlock()
      def generateGensisBlock(self):
          dect = {'nonce':0, 'tstamp':'Sun Oct 28 12:54:03 2018', 'transationList':[{'from_address':None, 'to_address':None, 'amount':0},],'hash':''}
          b = Block(**dect)
          self.chain.append(b.toDict())

      def getLastBlock(self):
          return Block(**self.chain[-1])

      def minePendingTransation(self, mining_reward_address):
          self.pendingTransations = [{'from_address':None,'to_address':mining_reward_address,'amount':self.mining_reward},]
          block = Block(0, str(datetime.now()),self.pendingTransations)
          block.prevhash = self.getLastBlock().hash
          block.mineBlock(self.difficult)
          print('Block is mined to get reward:',self.mining_reward)
          self.chain.append(block.toDict())

      def createTransation(self, from_address, to_address,amount):
          self.pendingTransations.append({'from_adress':from_address,'to_address':to_address, 'amount':amount})

      def getBalence(self,address):
          balance = 0
          for index in range(len(self.chain)):
              dictList=self.chain[index]['transationList']
              for dic in dictList:
                  if dic['to_address']==address:
                      balance += dic['amount']
                  if dic['from_address']==address:
                      balance -= dic['amount']
          return balance

      def isChainValid(self):
          for i in range(1,len(self.chain)):
              prevb =Block(**self.chain[i-1])
              currb =Block(**self.chain[i])
              if(currb.hash != currb.calcHash()):
                  print('invalid block')
                  return False
              if(currb.prevhash != prevb.hash):
                  print('invalid chain')
                  return False
          return True


  shangCoin = Blockchain()
  shangCoin.createTransation('address1', 'address2',100)
  shangCoin.createTransation('address2', 'address1',50)
  print('starting mining:')
  shangCoin.minePendingTransation("shangaddress")
  print('shangCoin miner balance is:', shangCoin.getBalence("shangaddress"))
  print(shangCoin.isChainValid())

#+END_SRC
