blockchain.html
<div id="outline-container-org546606b" class="outline-3">
<h3 id="org546606b">part4 (has error)</h3>
<div class="outline-text-3" id="text-org546606b">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> hashlib
<span style="font-weight: bold;">import</span> json
<span style="font-weight: bold;">from</span> datetime <span style="font-weight: bold;">import</span> datetime 
<span style="font-weight: bold;">from</span> flask <span style="font-weight: bold;">import</span> Flask
<span style="font-weight: bold;">from</span> flask <span style="font-weight: bold;">import</span> jsonify
<span style="font-weight: bold;">from</span> time <span style="font-weight: bold;">import</span> time

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Block</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, nonce, tstamp, transationList, prevhash=<span style="font-style: italic;">''</span>, <span style="font-weight: bold;">hash</span> =<span style="font-style: italic;">''</span>):
        <span style="font-weight: bold;">self</span>.nonce = nonce
        <span style="font-weight: bold;">self</span>.tstamp = tstamp
        <span style="font-weight: bold;">self</span>.transationList = transationList
        <span style="font-weight: bold;">self</span>.prevhash = prevhash
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">hash</span> == <span style="font-style: italic;">''</span>:
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> = <span style="font-weight: bold;">self</span>.calcHash
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> =<span style="font-weight: bold;">hash</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">toDict</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> {<span style="font-style: italic;">'nonce'</span>:<span style="font-weight: bold;">self</span>.nonce, <span style="font-style: italic;">'tstamp'</span>:<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.tstamp), <span style="font-style: italic;">'transation'</span>:<span style="font-weight: bold;">self</span>.transationList, <span style="font-style: italic;">'prevhash'</span>:<span style="font-weight: bold;">self</span>.prevhash, <span style="font-style: italic;">'hash'</span>:<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>}

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">calcHash</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">block_string</span> = json.dumps({<span style="font-style: italic;">'nonce'</span>:<span style="font-weight: bold;">self</span>.nonce, <span style="font-style: italic;">'tstamp'</span>:<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">self</span>.tstamp), <span style="font-style: italic;">'transation'</span>:<span style="font-weight: bold;">self</span>.transationList, <span style="font-style: italic;">'prevhash'</span>:<span style="font-weight: bold;">self</span>.prevhash}, sort_keys=<span style="font-weight: bold; text-decoration: underline;">True</span>).encode()
        <span style="font-weight: bold;">return</span> hashlib.sha256(block_string).hexdigest()
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">mineBlock</span>(<span style="font-weight: bold;">self</span>, difficult):
        <span style="font-weight: bold;">while</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>[:difficult] != <span style="font-weight: bold;">str</span>(<span style="font-style: italic;">''</span>).zfill(difficult)):
            <span style="font-weight: bold;">self</span>.nonce += 1
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span> = <span style="font-weight: bold;">self</span>.calcHash()
            <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'the mineBlock is:'</span>,<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">hash</span>)

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Blockchain</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.chain=[]
        <span style="font-weight: bold;">self</span>.difficult=3
        <span style="font-weight: bold;">self</span>.pendingTransations = []
        <span style="font-weight: bold;">self</span>.mining_reward = 100
        <span style="font-weight: bold;">self</span>.generateGensisBlock()
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">generateGensisBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">dect</span> = {<span style="font-style: italic;">'nonce'</span>:0, <span style="font-style: italic;">'tstamp'</span>:<span style="font-style: italic;">'Sun Oct 28 12:54:03 2018'</span>, <span style="font-style: italic;">'transationList'</span>:[{<span style="font-style: italic;">'from_address'</span>:<span style="font-weight: bold; text-decoration: underline;">None</span>, <span style="font-style: italic;">'to_address'</span>:<span style="font-weight: bold; text-decoration: underline;">None</span>, <span style="font-style: italic;">'amount'</span>:0},],<span style="font-style: italic;">'hash'</span>:<span style="font-style: italic;">''</span>}
        <span style="font-weight: bold; font-style: italic;">b</span> = Block(**dect)
        <span style="font-weight: bold;">self</span>.chain.append(b.toDict())

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getLastBlock</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> Block(**<span style="font-weight: bold;">self</span>.chain[-1])

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minePendingTransation</span>(<span style="font-weight: bold;">self</span>, mining_reward_address):
        <span style="font-weight: bold;">self</span>.pendingTransations = [{<span style="font-style: italic;">'from_address'</span>:<span style="font-weight: bold; text-decoration: underline;">None</span>,<span style="font-style: italic;">'to_address'</span>:mining_reward_address,<span style="font-style: italic;">'amount'</span>:<span style="font-weight: bold;">self</span>.mining_reward},]
        <span style="font-weight: bold; font-style: italic;">block</span> = Block(0, <span style="font-weight: bold;">str</span>(datetime.now()),<span style="font-weight: bold;">self</span>.pendingTransations)
        <span style="font-weight: bold; font-style: italic;">block.prevhash</span> = <span style="font-weight: bold;">self</span>.getLastBlock().<span style="font-weight: bold;">hash</span>
        block.mineBlock(<span style="font-weight: bold;">self</span>.difficult)
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'Block is mined to get reward:'</span>,<span style="font-weight: bold;">self</span>.mining_reward)
        <span style="font-weight: bold;">self</span>.chain.append(block.toDict())

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">createTransation</span>(<span style="font-weight: bold;">self</span>, from_address, to_address,amount):
        <span style="font-weight: bold;">self</span>.pendingTransations.append({<span style="font-style: italic;">'from_adress'</span>:from_address,<span style="font-style: italic;">'to_address'</span>:to_address, <span style="font-style: italic;">'amount'</span>:amount})

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getBalence</span>(<span style="font-weight: bold;">self</span>,address):
        <span style="font-weight: bold; font-style: italic;">balance</span> = 0
        <span style="font-weight: bold;">for</span> index <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.chain)):
            <span style="font-weight: bold; font-style: italic;">dictList</span>=<span style="font-weight: bold;">self</span>.chain[index][<span style="font-style: italic;">'transationList'</span>]
            <span style="font-weight: bold;">for</span> dic <span style="font-weight: bold;">in</span> dictList:
                <span style="font-weight: bold;">if</span> dic[<span style="font-style: italic;">'to_address'</span>]==address:
                    <span style="font-weight: bold; font-style: italic;">balance</span> += dic[<span style="font-style: italic;">'amount'</span>]
                <span style="font-weight: bold;">if</span> dic[<span style="font-style: italic;">'from_address'</span>]==address:
                    <span style="font-weight: bold; font-style: italic;">balance</span> -= dic[<span style="font-style: italic;">'amount'</span>]
        <span style="font-weight: bold;">return</span> balance

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">isChainValid</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1,<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.chain)):
            <span style="font-weight: bold; font-style: italic;">prevb</span> =Block(**<span style="font-weight: bold;">self</span>.chain[i-1])
            <span style="font-weight: bold; font-style: italic;">currb</span> =Block(**<span style="font-weight: bold;">self</span>.chain[i])
            <span style="font-weight: bold;">if</span>(currb.<span style="font-weight: bold;">hash</span> != currb.calcHash()):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid block'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
            <span style="font-weight: bold;">if</span>(currb.prevhash != prevb.<span style="font-weight: bold;">hash</span>):
                <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'invalid chain'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>


<span style="font-weight: bold; font-style: italic;">shangCoin</span> = Blockchain()
shangCoin.createTransation(<span style="font-style: italic;">'address1'</span>, <span style="font-style: italic;">'address2'</span>,100)
shangCoin.createTransation(<span style="font-style: italic;">'address2'</span>, <span style="font-style: italic;">'address1'</span>,50)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'starting mining:'</span>)
shangCoin.minePendingTransation(<span style="font-style: italic;">"shangaddress"</span>)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'shangCoin miner balance is:'</span>, shangCoin.getBalence(<span style="font-style: italic;">"shangaddress"</span>))
<span style="font-weight: bold;">print</span>(shangCoin.isChainValid())

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-01-23 Sun 14:25</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
